node {
  name: "x"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 16384
        }
      }
    }
  }
}
node {
  name: "labels"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 10
          }
        }
        string_val: "Zero"
        string_val: "One"
        string_val: "Two"
        string_val: "Three"
        string_val: "Four"
        string_val: "Five"
        string_val: "Six"
        string_val: "Seven"
        string_val: "Eight"
        string_val: "Nine"
      }
    }
  }
}
node {
  name: "classifier/Shape"
  op: "Shape"
  input: "x"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/strided_slice"
  op: "StridedSlice"
  input: "classifier/Shape"
  input: "classifier/strided_slice/stack"
  input: "classifier/strided_slice/stack_1"
  input: "classifier/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "classifier/stft/frame_length"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1024
      }
    }
  }
}
node {
  name: "classifier/stft/frame_step"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "classifier/stft/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1024
      }
    }
  }
}
node {
  name: "classifier/stft/frame/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "classifier/stft/frame/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/range"
  op: "Range"
  input: "classifier/stft/frame/range/start"
  input: "classifier/stft/frame/Rank"
  input: "classifier/stft/frame/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/add"
  op: "Add"
  input: "classifier/stft/frame/axis"
  input: "classifier/stft/frame/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/strided_slice/stack"
  op: "Pack"
  input: "classifier/stft/frame/axis"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/strided_slice/stack_1"
  op: "Pack"
  input: "classifier/stft/frame/add"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/strided_slice"
  op: "StridedSlice"
  input: "classifier/stft/frame/range"
  input: "classifier/stft/frame/strided_slice/stack"
  input: "classifier/stft/frame/strided_slice/stack_1"
  input: "classifier/stft/frame/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "classifier/stft/frame/Shape"
  op: "Shape"
  input: "x"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/sub/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/sub"
  op: "Sub"
  input: "classifier/stft/frame/Rank"
  input: "classifier/stft/frame/sub/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/sub_1"
  op: "Sub"
  input: "classifier/stft/frame/sub"
  input: "classifier/stft/frame/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/packed/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/packed"
  op: "Pack"
  input: "classifier/stft/frame/strided_slice"
  input: "classifier/stft/frame/packed/1"
  input: "classifier/stft/frame/sub_1"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/split"
  op: "SplitV"
  input: "classifier/stft/frame/Shape"
  input: "classifier/stft/frame/packed"
  input: "classifier/stft/frame/split/split_dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 3
    }
  }
}
node {
  name: "classifier/stft/frame/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "classifier/stft/frame/Reshape"
  op: "Reshape"
  input: "classifier/stft/frame/split:1"
  input: "classifier/stft/frame/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/Size"
  op: "Size"
  input: "classifier/stft/frame/split"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/Size_1"
  op: "Size"
  input: "classifier/stft/frame/split:2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/Neg"
  op: "Neg"
  input: "classifier/stft/frame/Reshape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/floordiv"
  op: "FloorDiv"
  input: "classifier/stft/frame/Neg"
  input: "classifier/stft/frame_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/Neg_1"
  op: "Neg"
  input: "classifier/stft/frame/floordiv"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/sub_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/sub_2"
  op: "Sub"
  input: "classifier/stft/frame/Neg_1"
  input: "classifier/stft/frame/sub_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/mul"
  op: "Mul"
  input: "classifier/stft/frame_step"
  input: "classifier/stft/frame/sub_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/add_1"
  op: "Add"
  input: "classifier/stft/frame_length"
  input: "classifier/stft/frame/mul"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/sub_3"
  op: "Sub"
  input: "classifier/stft/frame/add_1"
  input: "classifier/stft/frame/Reshape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/Maximum/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/Maximum"
  op: "Maximum"
  input: "classifier/stft/frame/Maximum/x"
  input: "classifier/stft/frame/sub_3"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/zeros/shape/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "classifier/stft/frame/zeros/shape"
  op: "Pack"
  input: "classifier/stft/frame/Size"
  input: "classifier/stft/frame/zeros/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/zeros"
  op: "Fill"
  input: "classifier/stft/frame/zeros/shape"
  input: "classifier/stft/frame/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/zeros_1/shape/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "classifier/stft/frame/zeros_1/shape"
  op: "Pack"
  input: "classifier/stft/frame/Size_1"
  input: "classifier/stft/frame/zeros_1/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/zeros_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/zeros_1"
  op: "Fill"
  input: "classifier/stft/frame/zeros_1/shape"
  input: "classifier/stft/frame/zeros_1/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/concat/values_1/0/0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/concat/values_1/0"
  op: "Pack"
  input: "classifier/stft/frame/concat/values_1/0/0"
  input: "classifier/stft/frame/Maximum"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/concat/values_1"
  op: "Pack"
  input: "classifier/stft/frame/concat/values_1/0"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/concat"
  op: "ConcatV2"
  input: "classifier/stft/frame/zeros"
  input: "classifier/stft/frame/concat/values_1"
  input: "classifier/stft/frame/zeros_1"
  input: "classifier/stft/frame/concat/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/PadV2"
  op: "PadV2"
  input: "x"
  input: "classifier/stft/frame/concat"
  input: "classifier/stft/frame/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/Shape_1"
  op: "Shape"
  input: "classifier/stft/frame/PadV2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/add_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/add_2"
  op: "Add"
  input: "classifier/stft/frame/strided_slice"
  input: "classifier/stft/frame/add_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/strided_slice_1/stack"
  op: "Pack"
  input: "classifier/stft/frame/strided_slice"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/strided_slice_1/stack_1"
  op: "Pack"
  input: "classifier/stft/frame/add_2"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/strided_slice_1"
  op: "StridedSlice"
  input: "classifier/stft/frame/Shape_1"
  input: "classifier/stft/frame/strided_slice_1/stack"
  input: "classifier/stft/frame/strided_slice_1/stack_1"
  input: "classifier/stft/frame/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "classifier/stft/frame/gcd/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "classifier/stft/frame/floordiv_1"
  op: "FloorDiv"
  input: "classifier/stft/frame_length"
  input: "classifier/stft/frame/gcd/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/floordiv_2"
  op: "FloorDiv"
  input: "classifier/stft/frame_step"
  input: "classifier/stft/frame/gcd/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/floordiv_3"
  op: "FloorDiv"
  input: "classifier/stft/frame/strided_slice_1"
  input: "classifier/stft/frame/gcd/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/mul_1"
  op: "Mul"
  input: "classifier/stft/frame/floordiv_3"
  input: "classifier/stft/frame/gcd/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/concat_1/values_1"
  op: "Pack"
  input: "classifier/stft/frame/mul_1"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/concat_1"
  op: "ConcatV2"
  input: "classifier/stft/frame/split"
  input: "classifier/stft/frame/concat_1/values_1"
  input: "classifier/stft/frame/split:2"
  input: "classifier/stft/frame/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/concat_2/values_1"
  op: "Pack"
  input: "classifier/stft/frame/floordiv_3"
  input: "classifier/stft/frame/gcd/Const"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/concat_2/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/concat_2"
  op: "ConcatV2"
  input: "classifier/stft/frame/split"
  input: "classifier/stft/frame/concat_2/values_1"
  input: "classifier/stft/frame/split:2"
  input: "classifier/stft/frame/concat_2/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/zeros_like"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/ones_like/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "classifier/stft/frame/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/ones_like"
  op: "Fill"
  input: "classifier/stft/frame/ones_like/Shape"
  input: "classifier/stft/frame/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/StridedSlice"
  op: "StridedSlice"
  input: "classifier/stft/frame/PadV2"
  input: "classifier/stft/frame/zeros_like"
  input: "classifier/stft/frame/concat_1"
  input: "classifier/stft/frame/ones_like"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/Reshape_1"
  op: "Reshape"
  input: "classifier/stft/frame/StridedSlice"
  input: "classifier/stft/frame/concat_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/range_1/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/range_1/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/range_1"
  op: "Range"
  input: "classifier/stft/frame/range_1/start"
  input: "classifier/stft/frame/Neg_1"
  input: "classifier/stft/frame/range_1/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/mul_2"
  op: "Mul"
  input: "classifier/stft/frame/range_1"
  input: "classifier/stft/frame/floordiv_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/Reshape_2/shape/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/Reshape_2/shape"
  op: "Pack"
  input: "classifier/stft/frame/Neg_1"
  input: "classifier/stft/frame/Reshape_2/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/Reshape_2"
  op: "Reshape"
  input: "classifier/stft/frame/mul_2"
  input: "classifier/stft/frame/Reshape_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/range_2/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/range_2/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/range_2"
  op: "Range"
  input: "classifier/stft/frame/range_2/start"
  input: "classifier/stft/frame/floordiv_1"
  input: "classifier/stft/frame/range_2/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/Reshape_3/shape/0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/frame/Reshape_3/shape"
  op: "Pack"
  input: "classifier/stft/frame/Reshape_3/shape/0"
  input: "classifier/stft/frame/floordiv_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/Reshape_3"
  op: "Reshape"
  input: "classifier/stft/frame/range_2"
  input: "classifier/stft/frame/Reshape_3/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/add_3"
  op: "Add"
  input: "classifier/stft/frame/Reshape_2"
  input: "classifier/stft/frame/Reshape_3"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/GatherV2"
  op: "GatherV2"
  input: "classifier/stft/frame/Reshape_1"
  input: "classifier/stft/frame/add_3"
  input: "classifier/stft/frame/strided_slice"
  attr {
    key: "Taxis"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "classifier/stft/frame/concat_3/values_1"
  op: "Pack"
  input: "classifier/stft/frame/Neg_1"
  input: "classifier/stft/frame_length"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/frame/concat_3/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/frame/concat_3"
  op: "ConcatV2"
  input: "classifier/stft/frame/split"
  input: "classifier/stft/frame/concat_3/values_1"
  input: "classifier/stft/frame/split:2"
  input: "classifier/stft/frame/concat_3/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/frame/Reshape_4"
  op: "Reshape"
  input: "classifier/stft/frame/GatherV2"
  input: "classifier/stft/frame/concat_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/hann_window/periodic"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: true
      }
    }
  }
}
node {
  name: "classifier/stft/hann_window/Cast"
  op: "Cast"
  input: "classifier/stft/hann_window/periodic"
  attr {
    key: "DstT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "classifier/stft/hann_window/FloorMod/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "classifier/stft/hann_window/FloorMod"
  op: "FloorMod"
  input: "classifier/stft/frame_length"
  input: "classifier/stft/hann_window/FloorMod/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/hann_window/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/hann_window/sub"
  op: "Sub"
  input: "classifier/stft/hann_window/sub/x"
  input: "classifier/stft/hann_window/FloorMod"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/hann_window/mul"
  op: "Mul"
  input: "classifier/stft/hann_window/Cast"
  input: "classifier/stft/hann_window/sub"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/hann_window/add"
  op: "Add"
  input: "classifier/stft/frame_length"
  input: "classifier/stft/hann_window/mul"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/hann_window/sub_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/hann_window/sub_1"
  op: "Sub"
  input: "classifier/stft/hann_window/add"
  input: "classifier/stft/hann_window/sub_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/hann_window/Cast_1"
  op: "Cast"
  input: "classifier/stft/hann_window/sub_1"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/hann_window/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/stft/hann_window/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/stft/hann_window/range"
  op: "Range"
  input: "classifier/stft/hann_window/range/start"
  input: "classifier/stft/frame_length"
  input: "classifier/stft/hann_window/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/hann_window/Cast_2"
  op: "Cast"
  input: "classifier/stft/hann_window/range"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/stft/hann_window/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 6.28318548203
      }
    }
  }
}
node {
  name: "classifier/stft/hann_window/mul_1"
  op: "Mul"
  input: "classifier/stft/hann_window/Const"
  input: "classifier/stft/hann_window/Cast_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "classifier/stft/hann_window/truediv"
  op: "RealDiv"
  input: "classifier/stft/hann_window/mul_1"
  input: "classifier/stft/hann_window/Cast_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "classifier/stft/hann_window/Cos"
  op: "Cos"
  input: "classifier/stft/hann_window/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "classifier/stft/hann_window/mul_2/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "classifier/stft/hann_window/mul_2"
  op: "Mul"
  input: "classifier/stft/hann_window/mul_2/x"
  input: "classifier/stft/hann_window/Cos"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "classifier/stft/hann_window/sub_2/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "classifier/stft/hann_window/sub_2"
  op: "Sub"
  input: "classifier/stft/hann_window/sub_2/x"
  input: "classifier/stft/hann_window/mul_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "classifier/stft/mul"
  op: "Mul"
  input: "classifier/stft/frame/Reshape_4"
  input: "classifier/stft/hann_window/sub_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "classifier/stft/rfft/packed"
  op: "Pack"
  input: "classifier/stft/Const"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/stft/rfft"
  op: "RFFT"
  input: "classifier/stft/mul"
  input: "classifier/stft/rfft/packed"
}
node {
  name: "classifier/Abs"
  op: "ComplexAbs"
  input: "classifier/stft/rfft"
  attr {
    key: "T"
    value {
      type: DT_COMPLEX64
    }
  }
  attr {
    key: "Tout"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/sample_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 16000.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/lower_edge_hertz"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 40.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/upper_edge_hertz"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 7800.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 0.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/truediv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 2.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/truediv"
  op: "RealDiv"
  input: "classifier/linear_to_mel_weight_matrix/sample_rate"
  input: "classifier/linear_to_mel_weight_matrix/truediv/y"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/LinSpace/num"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 513
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/LinSpace"
  op: "LinSpace"
  input: "classifier/linear_to_mel_weight_matrix/Const"
  input: "classifier/linear_to_mel_weight_matrix/truediv"
  input: "classifier/linear_to_mel_weight_matrix/LinSpace/num"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/strided_slice"
  op: "StridedSlice"
  input: "classifier/linear_to_mel_weight_matrix/LinSpace"
  input: "classifier/linear_to_mel_weight_matrix/strided_slice/stack"
  input: "classifier/linear_to_mel_weight_matrix/strided_slice/stack_1"
  input: "classifier/linear_to_mel_weight_matrix/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/truediv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 700.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/truediv"
  op: "RealDiv"
  input: "classifier/linear_to_mel_weight_matrix/strided_slice"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/truediv/y"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/add/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/add"
  op: "Add"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/add/x"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/truediv"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/Log"
  op: "Log"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/add"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1127.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/mul"
  op: "Mul"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/mul/x"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/Log"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/ExpandDims"
  op: "ExpandDims"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel/mul"
  input: "classifier/linear_to_mel_weight_matrix/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/truediv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 700.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/truediv"
  op: "RealDiv"
  input: "classifier/linear_to_mel_weight_matrix/lower_edge_hertz"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/truediv/y"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/add/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/add"
  op: "Add"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/add/x"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/truediv"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/Log"
  op: "Log"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/add"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1127.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/mul"
  op: "Mul"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/mul/x"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/Log"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/truediv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 700.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/truediv"
  op: "RealDiv"
  input: "classifier/linear_to_mel_weight_matrix/upper_edge_hertz"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/truediv/y"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/add/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/add"
  op: "Add"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/add/x"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/truediv"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/Log"
  op: "Log"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/add"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1127.0
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/mul"
  op: "Mul"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/mul/x"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/Log"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/LinSpace_1/num"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 130
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/LinSpace_1"
  op: "LinSpace"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_1/mul"
  input: "classifier/linear_to_mel_weight_matrix/hertz_to_mel_2/mul"
  input: "classifier/linear_to_mel_weight_matrix/LinSpace_1/num"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/frame/frame_length"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/frame/frame_step"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/frame/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "classifier/linear_to_mel_weight_matrix/frame/Rank"
  op: "Const"
  attr {
